<template>
	<div class="container">

		<QuestionItem
			v-for="question in questions"
			:key="question.title"
			:question="question"
		/>

	</div>
</template>

<script>
	import QuestionItem from '../components/Questions/QuestionItem'

	export default {
		components: { QuestionItem },
		data() {
			return {
				questions: [
					{
						title: 'Глубокий уровень погружения бодрит',
						text: 'Таким образом, перспективное планирование позволяет выполнить важные задания по разработке поставленных обществом задач. Противоположная точка зрения подразумевает, что непосредственные участники технического прогресса будут ассоциативно распределены по отраслям.'
					},
					{
						title: 'Допустим, ночь оказалась долгой',
						text: 'Таким образом, постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение прогресса профессионального сообщества. Каждый из нас понимает очевидную вещь: базовый вектор развития играет важную роль в формировании экспериментов, поражающих по своей масштабности и грандиозности.'
					}
				]
			}
		}
	}
</script>

<style scoped>

</style>
